{
  "input_folder": "archive",
  "input_characters": "characters",
  "output_folder": "result",
  "output_filename": "archive_sessions.json",
  "key_master": "Мастер подземелий",
  "key_players": "Действия игроков",
  "master_type": "Dungeon Master",
  "players_type": "Players",
  "User": "Действия игроков",
  "user": "Действия игроков",
  "ChatGPT": "Мастер подземелий",
  "chatgpt": "Мастер подземелий",
  "Действия игроков": "Действия игроков",
  "Мастер подземелий": "Мастер подземелий",
  "metadata_sessions": {
    "format": "session_archive",
    "archive_mode": "message_stream",
    "note": "Каждая запись в archive — это отдельное сообщение одного участника, не полная сцена. Сцены определяются логикой outline или группировкой по ID.",
    "id_policy": "sequential_per_message",
    "id_scope": "global",
    "id_notes": "ID уникален в пределах архива и присваивается последовательно по мере обработки сообщений.",
    "purpose": "semantic_search",
    "description": "Архив ролевой кампании «Осколки забытого мира», основанной на приключении «Затерянные копи Фандельвера» (5e). Архив хранит последовательные игровые сцены от лица Мастера (Dungeon Master) и игроков (Players). Используется для восстановления истории, отслеживания сюжетных веток, анализа персонажей, фракций, магии и ключевых решений.",
    "usage": "Используется моделью для точного анализа истории кампании, принятия решений и интерпретации текущего состояния мира. Последняя сцена определяется по максимальному ID в outline.",
    "limitations": [
      "Файлы обрабатываются последовательно, что влияет на порядок ID.",
      "Некоторые сцены могут быть неочевидны без заголовков или ключевых фраз."
    ],
    "structure": {
      "archive": "Массив сцен. Каждая сцена — объект с полями id, type, chapter, title, content. Упорядочены хронологически по ID.",
      "id": "Числовой уникальный идентификатор сцены.",
      "type": "Тип автора сцены: 'Dungeon Master' или 'Players'.",
      "chapter": "Номер главы, к которой относится сцена, используется в связке с outline.",
      "title": "Название сцены. Может отсутствовать или быть автоматически задано.",
      "content": "Текст сцены: описание, действия, диалоги, броски кубов.",
      "tags": "Необязательные метки для фильтрации и поиска.",
      "outline": "Структура глав, формируемая на основе заголовков. Указывает диапазон ID и тип главы."
    },
    "guidelines": [
      "Сцены — это завершённые диалоговые или игровые блоки между DM и игроками.",
      "ID всегда уникален и упорядочен.",
      "Outline — структура архива, используется моделью для навигации."
    ],
    "version": "3.1"
  }
}
